# Задание 3

for i in range(1,101):
    if (i % 10 == 2 and i % 100 != 12) or (i % 10 == 3 and i % 100 != 13) or (i % 10 == 4 and i % 100 != 14):

        ending = "а"
    elif i % 10 == 1 and i % 100 != 11:
        ending = ""
    else:
        ending = "ов"

    print(i, "процент" + ending)


# % 100 добавлено для реализации алгоритма для любого количества процентов,
# для значений в диапазоне 1 - 100 можно было использовать i != 12 и т.д.

